wdf_windbg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Windows WDF Driver Debug With WinDbg</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Windows WDF Driver Debug With WinDbg"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-01 日"/>
<meta name="author" content="Yannik Li"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./style.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Windows WDF Driver Debug With WinDbg</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Add a Serial Port For VMWare</a></li>
<li><a href="#sec-2">2 Config host</a></li>
<li><a href="#sec-3">3 Config target system(windows 7) in VMWare</a></li>
<li><a href="#sec-4">4 Start Debug</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Add a Serial Port For VMWare</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>"Add" -&gt; "Serial Port" -&gt; "Output to namedpipe", the pipe named "\\.\pipe\com<sub>1</sub>"
</li>
<li>select "This end is server"
</li>
<li>and "The other end is an application"
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Config host</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>add "-b -k com:pipe,port=\\.\pipe\com<sub>1</sub>,resets=0" in the setting of windbg shortkey  
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Config target system(windows 7) in VMWare</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>after start windows 7 in VMWare, modify port name "COM1" to "COM2", because the port name in VMWare is COM2
</li>
<li>run cmd.exe as administrator
</li>
<li>run "bcdedit /copy {current} /d "Vista  Debug" to get a GUID
</li>
<li>run “bcdedit /debug {The GUID Value} ON” to start debug function
</li>
<li>and run "bcdedit /dbgsettings SERIAL DEBUGPORT:1 BAUDRATE:115200" to config baudrate 
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Start Debug</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>run windbg in host computer
</li>
<li>"File" -&gt; "Symbol Search Path" to add the path to *.pdb of your driver
</li>
<li>"File" -&gt; "Source Search Path" to select driver source file path
</li>
<li>run "Ctrl+Break" or "Debug"-&gt;"Break" to connect to target system, and make the system in stop state
</li>
<li>input .reload to load module and symbol file
</li>
<li>use "lm l" list the symble file has been loaded
</li>
<li>“File" -&gt; "Open Source File" to open source file, and bp or "F9" to set break point
</li>
<li>input G to make target continue to run
</li>
<li>run driver test application in target system
</li>
<li>the color of break line will changed from red to pink
</li>
<li>and run P to debug driver step by step.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-01 日</p>
<p class="author">Author: Yannik Li</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
